#### Pandas :

> Open source data analysis and manipulation tool built on top of the Python.

> It provides easy-to-use, high-performance data structures and data analysis tools, primarily for handling tabular data (like spreadsheets or databases) in a structured form.


> Pandas strengthens Python by giving the popular programming language the capability to work with spreadsheet-like data enabling fast loading, aligning, manipulating, and merging


#### Key Features of Pandas:

1. Data alignment: Automatically aligns data based on row/column labels, preventing misalignment issues.

2. Handling missing data: Pandas has built-in methods for handling missing or NaN (Not a Number) values.

3. Flexible reshaping: You can reshape, pivot, and transform data using methods like melt, pivot, and stack.

4. Powerful indexing: Pandas supports both row and column indexing, making it easier to manipulate data efficiently.

5. Merge and join: It provides methods like merge() and join() for combining data from different sources.

6. Groupby functionality: You can group data by one or more columns and apply aggregation functions to it (e.g., sum, mean, count).

7. Time series support: Pandas has excellent support for time series data, allowing easy handling of dates, times, and frequency-based data.

![alt text](pandas_dtype.png "Title")

In [1]:
import pandas as pd

In [2]:
# 1-D array => Series
# 2-D array => Dataframe
# 3-D array => Panel (will be deprecreated in latest version and replaced by Dataframe)

In [3]:
# Series 
series = pd.Series() # Empty Series 
print(series)
print(type(series))

Series([], dtype: object)
<class 'pandas.core.series.Series'>

In [4]:
series = pd.Series([10,20,30,40,50]) 
print(series)
print(type(series))
print(series[1])

series = pd.Series([10,20,30,40,50], index=[1,2,3,4,5]) 
print(series)
print(series[1])
print(series[2:])

0    10
1    20
2    30
3    40
4    50
dtype: int64
<class 'pandas.core.series.Series'>
20
1    10
2    20
3    30
4    40
5    50
dtype: int64
10
3    30
4    40
5    50
dtype: int64

In [5]:
dictS = {'a': 10, 'b':20, 'c':30, 'd':40}
series = pd.Series(dictS)
print(series)
print(series['a'])   # Accesing the values through index labels
print(series[0]) # Accessing through index positions
print(series[['a','c']]) # Accessing the subset of index labels
print(series[:4]) # Slicing the data

a    10
b    20
c    30
d    40
dtype: int64
10
10
a    10
c    30
dtype: int64
a    10
b    20
c    30
d    40
dtype: int64

C:\Users\HP\AppData\Local\Temp\ipykernel_13908\4203875876.py:5: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(series[0]) # Accessing through index positions

In [6]:
seriesConstant = pd.Series(0, index=[1,2,3,4,5,6])
print(seriesConstant)

1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [7]:
# copy 
seriesCopy = seriesConstant.copy()
print(seriesCopy)

1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [8]:
# Dataframe => representation of data in row, col format. mutable

df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [9]:
df = pd.DataFrame([10, 20, 30, 40, 50])  # 1-D list => row = no.of elemnts = 5 , col=1
print(df)

    0
0  10
1  20
2  30
3  40
4  50

In [10]:
df = pd.DataFrame([[10], [30, 40], [50, 60]])  # 2-D list => row = no.of elemnts = 3 , col=2
print(df)

    0     1
0  10   NaN
1  30  40.0
2  50  60.0

In [11]:
df = pd.DataFrame([[10], [30, 40], [50, 60]], index=['r1', 'r2', 'r3'], columns=['col1', 'col2'])  # 2-D list => row = no.of elemnts = 3 , col=2
print(df)

    col1  col2
r1    10   NaN
r2    30  40.0
r3    50  60.0

In [12]:
# Accessing dataframe data

df['col1']   # Accesing the column 'col1'

r1    10
r2    30
r3    50
Name: col1, dtype: int64

In [13]:
df.col1  # Using dot operator, Accesing the column 'col1'

r1    10
r2    30
r3    50
Name: col1, dtype: int64

In [14]:
# Accesing rows 

# .loc and .iloc
# loc => Accessing rows by labels (index labels)
# iloc => Accessing rows by positions (index position)

print(df.loc['r1']) # Access row 1 : loc

print(df.iloc[0]) # Access the first row : iloc

col1    10.0
col2     NaN
Name: r1, dtype: float64
col1    10.0
col2     NaN
Name: r1, dtype: float64

In [15]:
print(df.loc['r1', 'col1']) # Access row 1 and within row 1 access column 1 values: loc

print(df.iloc[0, 0]) # Access fisrt row and within row 1 access column 1 values: : iloc

10
10

In [16]:
# Accessing multiple rows and column values
df.loc['r1':'r2', ['col1']]  # Access multiple rows and for each row fetch fisrt column

    col1
r1    10
r2    30

In [17]:
print(df.iloc[0:1, [0]])
print(df.iloc[0:1, 0])  # Access multiple rows and for each row fetch fisrt column 
print(df.iloc[0:2, 0:2])

    col1
r1    10
r1    10
Name: col1, dtype: int64
    col1  col2
r1    10   NaN
r2    30  40.0

In [18]:
# Reading CSV into dataframe

import pandas as pd

teamdata = pd.read_csv("team.csv") 
teamdata

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
454,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
455,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
456,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
457,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
458,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [19]:
teamdata.shape

(459, 9)

In [20]:
teamdata.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN

In [21]:
teamdata.tail(2)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
457,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
458,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [22]:
teamdata.index

RangeIndex(start=0, stop=459, step=1)

In [23]:
teamdata.columns

Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
       'College', 'Salary'],
      dtype='object')

In [24]:
print(teamdata.values)
print(type(teamdata.values))

[['Avery Bradley' 'Boston Celtics' 0.0 ... 180.0 'Texas' 7730337.0]
 ['Jae Crowder' 'Boston Celtics' 99.0 ... 235.0 'Marquette' 6796117.0]
 ['John Holland' 'Boston Celtics' 30.0 ... 205.0 'Boston University' nan]
 ...
 ['Tibor Pleiss' 'Utah Jazz' 21.0 ... 256.0 nan 2900000.0]
 ['Jeff Withey' 'Utah Jazz' 24.0 ... 231.0 'Kansas' 947276.0]
 [nan nan nan ... nan nan nan]]
<class 'numpy.ndarray'>

In [25]:
teamdata.axes

[RangeIndex(start=0, stop=459, step=1),
 Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
        'College', 'Salary'],
       dtype='object')]

In [26]:
teamdata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 459 entries, 0 to 458
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      458 non-null    object
 1   Team      458 non-null    object
 2   Number    458 non-null    float64
 3   Position  458 non-null    object
 4   Age       458 non-null    float64
 5   Height    458 non-null    object
 6   Weight    458 non-null    float64
 7   College   374 non-null    object
 8   Salary    447 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.4+ KB

In [27]:
# Access data 

# name = teamdata['Name'] # Single Column
name = teamdata[['Name']] # Single Column
name.head(2)

            Name
0  Avery Bradley
1    Jae Crowder

In [28]:
#name = teamdata[['Name', 'Team']] # Multi Column
name = teamdata[["Name", "Team"]] # Multi Column
name.head(2)

            Name            Team
0  Avery Bradley  Boston Celtics
1    Jae Crowder  Boston Celtics

In [29]:
teamdata.head(2)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0

In [30]:
teamdata.insert(8, column="Qualification", value="Higher School") # in-place operation
teamdata.head(2)

,Name,Team,Number,Position,Age,Height,Weight,College,Qualification,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,Higher School,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,Higher School,6796117.0

In [31]:
teamdata['Qualification'] = 'Senior Secondary'
teamdata.head(2)

,Name,Team,Number,Position,Age,Height,Weight,College,Qualification,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,Senior Secondary,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,Senior Secondary,6796117.0

In [32]:
teamdata['Salary'].value_counts()

Salary
947276.0      31
845059.0      18
525093.0      13
981348.0       6
16407500.0     5
              ..
2100000.0      1
1252440.0      1
2891760.0      1
3272091.0      1
900000.0       1
Name: count, Length: 310, dtype: int64

In [33]:
teamdata.dropna(how='all', inplace=True)

In [34]:
teamdata

,Name,Team,Number,Position,Age,Height,Weight,College,Qualification,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,Senior Secondary,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,Senior Secondary,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,Senior Secondary,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,Senior Secondary,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,Senior Secondary,5000000.0
...,...,...,...,...,...,...,...,...,...,...
454,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,Senior Secondary,2433333.0
455,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,Senior Secondary,900000.0
456,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,Senior Secondary,2900000.0
457,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,Senior Secondary,947276.0
458,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Senior Secondary,NaN

In [35]:
droppedNA = teamdata.dropna(subset=["Name", "Team"], inplace=False)
droppedNA

,Name,Team,Number,Position,Age,Height,Weight,College,Qualification,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,Senior Secondary,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,Senior Secondary,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,Senior Secondary,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,Senior Secondary,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,Senior Secondary,5000000.0
...,...,...,...,...,...,...,...,...,...,...
453,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,Kentucky,Senior Secondary,2239800.0
454,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,Senior Secondary,2433333.0
455,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,Senior Secondary,900000.0
456,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,Senior Secondary,2900000.0
457,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,Senior Secondary,947276.0

In [36]:
teamdata.tail(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Qualification,Salary
456,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,Senior Secondary,2900000.0
457,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,Senior Secondary,947276.0
458,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Senior Secondary,NaN

In [37]:
# Pandas option to show all rows and columns

#pd.set_option('display.max_rows', None)
#pd.set_option('display.max_columns', None)
#pd.set_option('display.max_colwidth', None)

# reset the options
pd.reset_option('display.max_rows')
pd.reset_option('display.max_columns')
pd.reset_option('display.max_colwidth')

In [38]:
teamdata

,Name,Team,Number,Position,Age,Height,Weight,College,Qualification,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,Senior Secondary,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,Senior Secondary,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,Senior Secondary,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,Senior Secondary,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,Senior Secondary,5000000.0
...,...,...,...,...,...,...,...,...,...,...
454,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,Senior Secondary,2433333.0
455,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,Senior Secondary,900000.0
456,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,Senior Secondary,2900000.0
457,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,Senior Secondary,947276.0
458,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Senior Secondary,NaN

In [39]:
# Replacing NaN with default values, will be deprecated in pandas 3.0
# Issue : https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

#droppedNA["Height"].fillna(0, inplace=True)
#droppedNA["Height"] = droppedNA["Height"].fillna(0)
droppedNA.fillna({"Height": 0}, inplace=True)

droppedNA["Weight"].fillna(0, inplace=True)
droppedNA["Salary"].fillna(0, inplace=True)
droppedNA["College"].fillna("Not Available", inplace=True)


droppedNA

C:\Users\HP\AppData\Local\Temp\ipykernel_13908\4258871110.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  droppedNA.fillna({"Height": 0}, inplace=True)
C:\Users\HP\AppData\Local\Temp\ipykernel_13908\4258871110.py:8: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  droppedNA["Weight"].fillna(0, inplace=True)
C:\Users\HP\AppData\Local\Temp\ipykernel_13908\4258871110.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  droppedNA["Weight"].fillna(0, inplace=True)
C:\Users\HP\AppData\Local\Temp\ipykernel_13908\4258871110.py:9: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  droppedNA["Salary"].fillna(0, inplace=True)
C:\Users\HP\AppData\Local\Temp\ipykernel_13908\4258871110.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  droppedNA["Salary"].fillna(0, inplace=True)
C:\Users\HP\AppData\Local\Temp\ipykernel_13908\4258871110.py:10: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  droppedNA["College"].fillna("Not Available", inplace=True)
C:\Users\HP\AppData\Local\Temp\ipykernel_13908\4258871110.py:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  droppedNA["College"].fillna("Not Available", inplace=True)

,Name,Team,Number,Position,Age,Height,Weight,College,Qualification,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,Senior Secondary,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,Senior Secondary,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,Senior Secondary,0.0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,Senior Secondary,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,Not Available,Senior Secondary,5000000.0
...,...,...,...,...,...,...,...,...,...,...
453,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,Kentucky,Senior Secondary,2239800.0
454,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,Senior Secondary,2433333.0
455,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,Not Available,Senior Secondary,900000.0
456,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,Not Available,Senior Secondary,2900000.0
457,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,Senior Secondary,947276.0

In [42]:
# Sorting the data 
# sort_values()
# sort_index()
teamdata.sort_values("Name") # Default ascending order
teamdata.sort_values("Name", ascending=False) # Descending
teamdata.sort_values("Name", ascending=True) # ascending order

teamdata.sort_values("Name", ascending=True, na_position="first") # NaNs at the beginning
teamdata.sort_values("Name", ascending=True, na_position="last") # NaNs at the beginning

teamdata.sort_values(["Name", "Team"], ascending=[True, False], na_position="first", inplace=False) # Sorting the data on Name and then on Team
teamdata.sort_values(["Name", "Team"], ascending=[True, True], na_position="first") # Sorting the data on Name and then on Team

teamdata.sort_index(ascending=True)
teamdata.sort_index(ascending=False) # Get the another object after re-ordering, inplace=False
teamdata.sort_index(ascending=False, inplace=True) # Reordering teh original dataframe

In [ ]:
teamdata.info

<class 'pandas.core.frame.DataFrame'>
Index: 459 entries, 458 to 0
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           458 non-null    object
 1   Team           458 non-null    object
 2   Number         458 non-null    float64
 3   Position       458 non-null    object
 4   Age            458 non-null    float64
 5   Height         458 non-null    object
 6   Weight         458 non-null    float64
 7   College        374 non-null    object
 8   Qualification  459 non-null    object
 9   Salary         447 non-null    float64
dtypes: float64(4), object(6)
memory usage: 39.4+ KB

In [55]:
# Aggregation Operation : Summary
# Functions like : min(), max(), count(), sum(), mean() and so on
# groupby


min_sal = teamdata['Salary'].min()
print(min_sal)

max_sal = teamdata['Salary'].max()
print(max_sal)


min_sal_per_team = teamdata.groupby('Team')['Salary'].min()
print(min_sal_per_team)

max_sal_per_team = teamdata.groupby('Team')['Salary'].max()
print(max_sal_per_team)

# Multiple aggregation on single column, Salary
sal_per_team = teamdata.groupby('Team')['Salary'].agg(['min', 'max'])
print(sal_per_team)

# Data grouping on multiple columns. Multiple aggregation on single column, Salary. 
sal_per_team = teamdata.groupby(['Name', 'Team'])['Salary'].agg(['min', 'max'])
print(sal_per_team)

# Multiple aggregation on multiple column, Weight and Salary
multi_col_agg = teamdata.groupby('Team').agg({
    'Weight' : 'min', 
    'Salary' : 'max'
    })
print(multi_col_agg)

30888.0
25000000.0
Team
Atlanta Hawks              525093.0
Boston Celtics            1148640.0
Brooklyn Nets              134215.0
Charlotte Hornets          189455.0
Chicago Bulls              525093.0
Cleveland Cavaliers        111196.0
Dallas Mavericks           525093.0
Denver Nuggets             258489.0
Detroit Pistons            111444.0
Golden State Warriors      289755.0
Houston Rockets            200600.0
Indiana Pacers             211744.0
Los Angeles Clippers       111444.0
Los Angeles Lakers         525093.0
Memphis Grizzlies          700902.0
Miami Heat                 261894.0
Milwaukee Bucks            295327.0
Minnesota Timberwolves     947276.0
New Orleans Pelicans        55722.0
New York Knicks             30888.0
Oklahoma City Thunder      222888.0
Orlando Magic              845059.0
Philadelphia 76ers         525093.0
Phoenix Suns                55722.0
Portland Trail Blazers     525093.0
Sacramento Kings           525093.0
San Antonio Spurs          200600.0
Toronto Raptors            245177.0
Utah Jazz                  900000.0
Washington Wizards         200600.0
Name: Salary, dtype: float64
Team
Atlanta Hawks             18671659.0
Boston Celtics            12000000.0
Brooklyn Nets             19689000.0
Charlotte Hornets         13500000.0
Chicago Bulls             20093064.0
Cleveland Cavaliers       22970500.0
Dallas Mavericks          16407500.0
Denver Nuggets            14000000.0
Detroit Pistons           16000000.0
Golden State Warriors     15501000.0
Houston Rockets           22359364.0
Indiana Pacers            17120106.0
Los Angeles Clippers      21468695.0
Los Angeles Lakers        25000000.0
Memphis Grizzlies         19688000.0
Miami Heat                22192730.0
Milwaukee Bucks           16407500.0
Minnesota Timberwolves    12700000.0
New Orleans Pelicans      15514031.0
New York Knicks           22875000.0
Oklahoma City Thunder     20158622.0
Orlando Magic             11250000.0
Philadelphia 76ers         6500000.0
Phoenix Suns              13500000.0
Portland Trail Blazers     8042895.0
Sacramento Kings          15851950.0
San Antonio Spurs         19689000.0
Toronto Raptors           13600000.0
Utah Jazz                 15409570.0
Washington Wizards        15851950.0
Name: Salary, dtype: float64
                              min         max
Team
Atlanta Hawks            525093.0  18671659.0
Boston Celtics          1148640.0  12000000.0
Brooklyn Nets            134215.0  19689000.0
Charlotte Hornets        189455.0  13500000.0
Chicago Bulls            525093.0  20093064.0
Cleveland Cavaliers      111196.0  22970500.0
Dallas Mavericks         525093.0  16407500.0
Denver Nuggets           258489.0  14000000.0
Detroit Pistons          111444.0  16000000.0
Golden State Warriors    289755.0  15501000.0
Houston Rockets          200600.0  22359364.0
Indiana Pacers           211744.0  17120106.0
Los Angeles Clippers     111444.0  21468695.0
Los Angeles Lakers       525093.0  25000000.0
Memphis Grizzlies        700902.0  19688000.0
Miami Heat               261894.0  22192730.0
Milwaukee Bucks          295327.0  16407500.0
Minnesota Timberwolves   947276.0  12700000.0
New Orleans Pelicans      55722.0  15514031.0
New York Knicks           30888.0  22875000.0
Oklahoma City Thunder    222888.0  20158622.0
Orlando Magic            845059.0  11250000.0
Philadelphia 76ers       525093.0   6500000.0
Phoenix Suns              55722.0  13500000.0
Portland Trail Blazers   525093.0   8042895.0
Sacramento Kings         525093.0  15851950.0
San Antonio Spurs        200600.0  19689000.0
Toronto Raptors          245177.0  13600000.0
Utah Jazz                900000.0  15409570.0
Washington Wizards       200600.0  15851950.0
                                               min         max
Name            Team
Aaron Brooks    Chicago Bulls            2250000.0   2250000.0
                Sacramento Kings         1250000.0   1250000.0
Aaron Gordon    Orlando Magic            4171680.0   4171680.0
Aaron Harrison  Charlotte Hornets         525093.0    525093.0
Adreian Payne   Minnesota Timberwolves   1938840.0   1938840.0
...                                            ...         ...
Wilson Chandler Denver Nuggets          10449438.0  10449438.0
Xavier Munford  Memphis Grizzlies              NaN         NaN
Zach LaVine     Minnesota Timberwolves   2148360.0   2148360.0
Zach Randolph   Memphis Grizzlies        9638555.0   9638555.0
Zaza Pachulia   Dallas Mavericks         5200000.0   5200000.0

[458 rows x 2 columns]
                        Weight      Salary
Team
Atlanta Hawks            172.0  18671659.0
Boston Celtics           180.0  12000000.0
Brooklyn Nets            175.0  19689000.0
Charlotte Hornets        184.0  13500000.0
Chicago Bulls            161.0  20093064.0
Cleveland Cavaliers      179.0  22970500.0
Dallas Mavericks         185.0  16407500.0
Denver Nuggets           175.0  14000000.0
Detroit Pistons          172.0  16000000.0
Golden State Warriors    175.0  15501000.0
Houston Rockets          185.0  22359364.0
Indiana Pacers           180.0  17120106.0
Los Angeles Clippers     175.0  21468695.0
Los Angeles Lakers       175.0  25000000.0
Memphis Grizzlies        165.0  19688000.0
Miami Heat               165.0  22192730.0
Milwaukee Bucks          190.0  16407500.0
Minnesota Timberwolves   189.0  12700000.0
New Orleans Pelicans     170.0  15514031.0
New York Knicks          195.0  22875000.0
Oklahoma City Thunder    185.0  20158622.0
Orlando Magic            169.0  11250000.0
Philadelphia 76ers       175.0   6500000.0
Phoenix Suns             175.0  13500000.0
Portland Trail Blazers   173.0   8042895.0
Sacramento Kings         161.0  15851950.0
San Antonio Spurs        185.0  19689000.0
Toronto Raptors          190.0  13600000.0
Utah Jazz                179.0  15409570.0
Washington Wizards       190.0  15851950.0

In [57]:
# Merging and Joins 

sales1 = pd.read_csv("Sales1.csv")
sales2 = pd.read_csv("Sales2.csv")

In [58]:
sales1

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
245          413        9
246          926        6
247          134        3
248          396        6
249          535       10

[250 rows x 2 columns]

In [59]:
sales2

     Customer ID  Food ID
0            688       10
1            813        7
2            495       10
3            189        5
4            267        3
..           ...      ...
245          783       10
246          556       10
247          547        9
248          252        9
249          249        6

[250 rows x 2 columns]

In [60]:
sales1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 250 entries, 0 to 249
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Customer ID  250 non-null    int64
 1   Food ID      250 non-null    int64
dtypes: int64(2)
memory usage: 4.0 KB

In [61]:
sales2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 250 entries, 0 to 249
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Customer ID  250 non-null    int64
 1   Food ID      250 non-null    int64
dtypes: int64(2)
memory usage: 4.0 KB

In [ ]:
# concat operation
pd.concat([sales1, sales2])

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
245          783       10
246          556       10
247          547        9
248          252        9
249          249        6

[500 rows x 2 columns]

In [66]:
(pd.concat([sales1, sales2])).shape

(500, 2)

In [70]:
pd.concat([sales1, sales2], keys=["sales1", "sales2"])

            Customer ID  Food ID
sales1 0            537        9
       1             97        4
       2            658        1
       3            202        2
       4            155        9
...                 ...      ...
sales2 245          783       10
       246          556       10
       247          547        9
       248          252        9
       249          249        6

[500 rows x 2 columns]

In [72]:
# Merging (kind of SQL joins)
# merge() - inner, outer, left snd right

sales1.merge(sales2, how="inner", on="Customer ID")

    Customer ID  Food ID_x  Food ID_y
0           537          9          5
1           155          9          3
2           503          5          8
3           503          5          9
4           155          1          3
..          ...        ...        ...
57          945          5          4
58          343          3          5
59          343          3          2
60          343          3          7
61          621          9          6

[62 rows x 3 columns]

In [80]:
x = sales1.merge(sales2, how="outer", on="Customer ID")
x

     Customer ID  Food ID_x  Food ID_y
0              3        2.0        NaN
1              8        NaN        6.0
2             10        2.0        NaN
3             13        NaN        2.0
4             20        1.0        NaN
..           ...        ...        ...
449          985        5.0        NaN
450          991        2.0        NaN
451          994        NaN        2.0
452          996        NaN       10.0
453         1000        2.0        NaN

[454 rows x 3 columns]

In [82]:
x = sales1.merge(sales2, how="left", on="Customer ID")
x

     Customer ID  Food ID_x  Food ID_y
0            537          9        5.0
1             97          4        NaN
2            658          1        NaN
3            202          2        NaN
4            155          9        3.0
..           ...        ...        ...
252          413          9        NaN
253          926          6        NaN
254          134          3        NaN
255          396          6        NaN
256          535         10        NaN

[257 rows x 3 columns]

In [84]:
x = sales1.merge(sales2, how="right", on="Customer ID")
x

     Customer ID  Food ID_x  Food ID_y
0            688        NaN         10
1            813        NaN          7
2            495        NaN         10
3            189        4.0          5
4            267        NaN          3
..           ...        ...        ...
254          783        6.0         10
255          556        NaN         10
256          547        NaN          9
257          252        NaN          9
258          249        9.0          6

[259 rows x 3 columns]

In [85]:
sales1.merge(sales2, how="inner", on="Customer ID", suffixes=['-s1', '-s2'])

    Customer ID  Food ID-s1  Food ID-s2
0           537           9           5
1           155           9           3
2           503           5           8
3           503           5           9
4           155           1           3
..          ...         ...         ...
57          945           5           4
58          343           3           5
59          343           3           2
60          343           3           7
61          621           9           6

[62 rows x 3 columns]